{"class_name": "Sequential", "keras_version": "2.2.4-tf", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_4", "kernel_regularizer": null, "batch_input_shape": [null, 64, 64, 3], "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_constraint": null, "padding": "valid", "trainable": true, "dtype": "float32", "activation": "relu", "bias_regularizer": null, "filters": 32}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "pool_size": [2, 2], "padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_constraint": null, "padding": "valid", "trainable": true, "dtype": "float32", "activation": "relu", "bias_regularizer": null, "filters": 32}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "pool_size": [2, 2], "padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_constraint": null, "padding": "valid", "trainable": true, "dtype": "float32", "activation": "relu", "bias_regularizer": null, "filters": 32}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "pool_size": [2, 2], "padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_constraint": null, "padding": "valid", "trainable": true, "dtype": "float32", "activation": "relu", "bias_regularizer": null, "filters": 32}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_7", "pool_size": [2, 2], "padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "dtype": "float32"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last", "dtype": "float32"}}, {"class_name": "Dense", "config": {"name": "dense_2", "kernel_regularizer": null, "units": 128, "activity_regularizer": null, "bias_constraint": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "trainable": true, "activation": "relu", "bias_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "kernel_regularizer": null, "units": 33, "activity_regularizer": null, "bias_constraint": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "trainable": true, "activation": "softmax", "bias_regularizer": null}}]}}