{"backend": "tensorflow", "config": {"layers": [{"config": {"kernel_constraint": null, "kernel_size": [3, 3], "dtype": "float32", "name": "conv2d_8", "padding": "valid", "batch_input_shape": [null, 64, 64, 3], "data_format": "channels_last", "bias_constraint": null, "activation": "relu", "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "filters": 32}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "dtype": "float32", "name": "max_pooling2d_8", "padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "kernel_size": [3, 3], "dtype": "float32", "name": "conv2d_9", "padding": "valid", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_constraint": null, "activation": "relu", "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "filters": 32}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "dtype": "float32", "name": "max_pooling2d_9", "padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "kernel_size": [3, 3], "dtype": "float32", "name": "conv2d_10", "padding": "valid", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_constraint": null, "activation": "relu", "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "filters": 32}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "dtype": "float32", "name": "max_pooling2d_10", "padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "kernel_size": [3, 3], "dtype": "float32", "name": "conv2d_11", "padding": "valid", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_constraint": null, "activation": "relu", "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "filters": 32}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "dtype": "float32", "name": "max_pooling2d_11", "padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_last", "dtype": "float32", "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "dtype": "float32", "name": "dense_4", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "units": 128, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "dtype": "float32", "name": "dense_5", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "softmax", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "units": 33, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null}, "class_name": "Dense"}], "name": "sequential_2"}, "class_name": "Sequential", "keras_version": "2.2.4-tf"}