{"keras_version": "2.2.4-tf", "backend": "tensorflow", "class_name": "Sequential", "config": {"name": "sequential_3", "layers": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "filters": 32, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "padding": "valid", "strides": [1, 1], "activation": "relu", "dtype": "float32", "dilation_rate": [1, 1], "batch_input_shape": [null, 64, 64, 3], "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "name": "conv2d_12", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_12", "padding": "valid", "strides": [2, 2], "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "filters": 32, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "padding": "valid", "strides": [1, 1], "activation": "relu", "dtype": "float32", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "name": "conv2d_13", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_13", "padding": "valid", "strides": [2, 2], "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "filters": 32, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "padding": "valid", "strides": [1, 1], "activation": "relu", "dtype": "float32", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "name": "conv2d_14", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_14", "padding": "valid", "strides": [2, 2], "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "filters": 32, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "padding": "valid", "strides": [1, 1], "activation": "relu", "dtype": "float32", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "name": "conv2d_15", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_15", "padding": "valid", "strides": [2, 2], "dtype": "float32"}}, {"class_name": "Flatten", "config": {"name": "flatten_3", "dtype": "float32", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "dtype": "float32", "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "relu", "units": 128, "use_bias": true, "name": "dense_6", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "dtype": "float32", "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "softmax", "units": 33, "use_bias": true, "name": "dense_7", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}]}}