{"keras_version": "2.2.4-tf", "class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dtype": "float32", "activation": "relu", "bias_regularizer": null, "filters": 32, "trainable": true, "batch_input_shape": [null, 64, 64, 3], "name": "conv2d", "padding": "valid", "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "dtype": "float32", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dtype": "float32", "activation": "relu", "bias_regularizer": null, "filters": 32, "trainable": true, "name": "conv2d_1", "padding": "valid", "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "dtype": "float32", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dtype": "float32", "activation": "relu", "bias_regularizer": null, "filters": 32, "trainable": true, "name": "conv2d_2", "padding": "valid", "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "dtype": "float32", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dtype": "float32", "activation": "relu", "bias_regularizer": null, "filters": 32, "trainable": true, "name": "conv2d_3", "padding": "valid", "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_3", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "dtype": "float32", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten", "data_format": "channels_last", "dtype": "float32"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "activation": "relu", "bias_regularizer": null, "units": 128, "name": "dense", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "activation": "softmax", "bias_regularizer": null, "units": 4, "name": "dense_1", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null}}], "name": "sequential"}}