_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_20 (Conv2D)           (None, 62, 62, 32)        896       
_________________________________________________________________
max_pooling2d_20 (MaxPooling (None, 31, 31, 32)        0         
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 29, 29, 32)        9248      
_________________________________________________________________
max_pooling2d_21 (MaxPooling (None, 14, 14, 32)        0         
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 12, 12, 32)        9248      
_________________________________________________________________
max_pooling2d_22 (MaxPooling (None, 6, 6, 32)          0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 4, 4, 32)          9248      
_________________________________________________________________
max_pooling2d_23 (MaxPooling (None, 2, 2, 32)          0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 128)               0         
_________________________________________________________________
dense_10 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_11 (Dense)             (None, 33)                4257      
=================================================================
Total params: 49,409
Trainable params: 49,409
Non-trainable params: 0
_________________________________________________________________
